#---------------------------------------------------------------------------------------------------------------------------------------------------------------
# Подготовительные операции:
# Прописываем путь  в переменную path (Свойства системы -> переменные среды -> path -> изменить переменную среды -> создать-> C:\Program Files\PostgreSQL\12\bin\
# Запускаем командную строку:
Win+R -> cmd.exe  
# Меняем в настройках терминала шрифт на Lucida Console
#----------------------------------------------------------------------------------------------------------------------------------------------------------------
# Задание 1. Работа с командной строкой
#----------------------------------------------------------------------------------------------------------------------------------------------------------------
# 1.1. Создайте новую базу данных с любым названием
#----------------------------------------------------------------------------------------------------------------------------------------------------------------
# запускаем утилиту psql  с ключом -c (command) для создания базы данных hr
psql -h localhost -p 5432 -U postgres
# вводим пароль пользователя postgres - на экране не отображается
# меняем кодовую страницу
\! chcp 1251 
set client_encoding="win1251";
# создаем БД hr
CREATE DATABASE hr;
# проверяем, что такая БД создана
\l
# закрываем сеанс
\q
#----------------------------------------------------------------------------------------------------------------------------------------------------------------
# 1.2. Восстановите бэкап учебной базы данных в новую базу данных с помощью psql
#----------------------------------------------------------------------------------------------------------------------------------------------------------------
# запускаем утилиту psql для восстановления БД hr из скрипта hr.sql ( К скрипту указываем полный путь)
psql -h localhost -p 5432 -U postgres -d hr -f C:\WORK\SQL_solutions\ХАЩАНОВ\hr.sql 
# Вводим пароль пользователя postgres - на экране не отображается
# Выполнение скрипта по восстановлению hr - на экран выводятся куча сообщений INSERT 0 1 и ALTER TABLE, по окончании - происходит автоматический выход из psql
# В ходе выполнения создается схема hr, создаются таблицы внутри этой схемы, в них заносятся данные
# Для проверки результатов вновь выполним вход с подключением к hr
psql -h localhost -p 5432 -U postgres -d hr
# Вводим пароль пользователя postgres - на экране не отображается
# Приходится снова поправлять кодовую страницу
\! chcp 1251 
set client_encoding="win1251";
# Проверим наличие схемы hr (выводим список схем)
\dn
# Укажем путь к hr явным образом
\с set search_path to hr;
# Подключимся к БД hr:
\c hr;
# Выведем полный список таблиц hr:
\d
# можно было бы все проверить одной командой, но все равно требовалось поправлять кодовую страницу.
# если выйти из сессии, но не закрывать окно терминала, то с кодовой страницей будет все в порядке
/q
# Можно совместить запуск psql с указанием пути, подключением к hr и выводом данных из таблицы city без входа в интерактивный режим
psql -h localhost -p 5432 -U postgres -d hr -c "set search_path to hr;" -c "select * from city;"
# Вводим пароль пользователя postgres. На экран выводится содержимое таблицы city 

#----------------------------------------------------------------------------------------------------------------------------------------------------------------
# Задание 2. Работа с пользователями
set search_path to hr;
#----------------------------------------------------------------------------------------------------------------------------------------------------------------
2.1. Создайте нового пользователя MyUser, которому разрешен вход, но не задан пароль и права доступа.
#----------------------------------------------------------------------------------------------------------------------------------------------------------------
# ВАЖНО! Создавать пользователя  в нужной БД и в нужной схеме! ПРОВЕРЯТЬ!
CREATE ROLE MyUser WITH LOGIN;
#----------------------------------------------------------------------------------------------------------------------------------------------------------------
# 2.2. Задайте пользователю MyUser любой пароль сроком действия до последнего дня текущего месяца.
#----------------------------------------------------------------------------------------------------------------------------------------------------------------
ALTER ROLE MyUser WITH PASSWORD '12345' VALID UNTIL '30.10.2022';
#----------------------------------------------------------------------------------------------------------------------------------------------------------------
# 2.3. Дайте пользователю MyUser права на чтение данных из двух любых таблиц восстановленной базы данных.
#----------------------------------------------------------------------------------------------------------------------------------------------------------------
# забираем у пользователя все что только можно.
revoke all privileges on database "hr" from MyUser;
revoke all privileges on schema hr from MyUser;
revoke all privileges on schema public from MyUser;
revoke all privileges on schema information_schema from MyUser;
revoke all privileges on schema  pg_catalog from MyUser;
revoke all privileges on all tables in schema hr from MyUser ;
revoke all privileges on all tables in schema public from MyUser ;
revoke all privileges on all tables in schema information_schema from MyUser ;
revoke all privileges on all tables in schema  pg_catalog from MyUser ;
# Даем право на чтение из 2 таблиц
GRANT SELECT ON  city, address TO MyUser;
#----------------------------------------------------------------------------------------------------------------------------------------------------------------
# 2.4. Заберите право на чтение данных ранее выданных таблиц
#----------------------------------------------------------------------------------------------------------------------------------------------------------------
REVOKE SELECT ON  city, address FROM MyUser;
#----------------------------------------------------------------------------------------------------------------------------------------------------------------
# 2.5. Удалите пользователя MyUser.
#----------------------------------------------------------------------------------------------------------------------------------------------------------------

REASSIGN OWNED BY MyUser TO postgres;
DROP OWNED BY MyUser;
DROP ROLE IF EXISTS MyUser;
#----------------------------------------------------------------------------------------------------------------------------------------------------------------
# Задание 3. Работа с транзакциями
#----------------------------------------------------------------------------------------------------------------------------------------------------------------
#3.1. Начните транзакцию
#----------------------------------------------------------------------------------------------------------------------------------------------------------------
BEGIN;
#----------------------------------------------------------------------------------------------------------------------------------------------------------------
3.2. Добавьте в таблицу projects новую запись
#----------------------------------------------------------------------------------------------------------------------------------------------------------------
INSERT INTO hr.projects
(project_id, "name", employees_id, amount, assigned_id, created_at)
VALUES(129, 'Новый проект', array[2], 100000., 516, '2019-02-14 12:57:59.000');

#----------------------------------------------------------------------------------------------------------------------------------------------------------------
3.3. Создайте точку сохранения
#----------------------------------------------------------------------------------------------------------------------------------------------------------------
SAVEPOINT my_savepoint;
#----------------------------------------------------------------------------------------------------------------------------------------------------------------
# 3.4. Удалите строку, добавленную в п.3.2
#----------------------------------------------------------------------------------------------------------------------------------------------------------------
DELETE FROM hr.projects WHERE project_id =129;
#----------------------------------------------------------------------------------------------------------------------------------------------------------------
3.5. Откатитесь к точке сохранения
#----------------------------------------------------------------------------------------------------------------------------------------------------------------
ROLLBACK TO my_savepoint;
#----------------------------------------------------------------------------------------------------------------------------------------------------------------
3.6. Завершите транзакцию.
#----------------------------------------------------------------------------------------------------------------------------------------------------------------
commit;
END;